Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: Register the error handling function *error_handler* under the name *name*. *error_handler* will be called during encoding and decoding in case of an error, when *name* is specified as the errors parameter.
pl: Zwróć zadanie obsługi błędu *error_handler* pod nazwą *name*. *error_handler* będzie wywołany w czasie kodowania i dekodowania w przypadku błędu, gdy *nazwa* - z ang. - *name* jest określone dla parametrów błędów.

source: For encoding *error_handler* will be called with a :exc:`UnicodeEncodeError` instance, which contains information about the location of the error. The error handler must either raise this or a different exception or return a tuple with a replacement for the unencodable part of the input and a position where encoding should continue. The encoder will encode the replacement and continue encoding the original input at the specified position. Negative position values will be treated as being relative to the end of the input string. If the resulting position is out of bound an :exc:`IndexError` will be raised.
pl: Dla kodowania *error_handler* będzie wywołane z przykładem :exc:`UnicodeEncodeError` który zawiera informacje o położeniu błędu. Obsługa błędu musi albo zgłosić ten lub inny wyjątek lub zwrócić krotkę z zamiennikiem dla niedekodowalną część wejścia i pozycję gdzie kodowanie powinno kontynuować. Kodowanie będzie kodować zamiennik i kontynuować kodowanie oryginalnego wejścia w określonej pozycji. Ujemne wartości pozycji zostaną potraktowane jako będące odniesieniem do końca ciągu wejściowego. Jeśli powstała pozycja jest poza zakresem wyjątek :exc:`IndexError` zostanie zgłoszony.

source: Decoding and translating works similar, except :exc:`UnicodeDecodeError` or :exc:`UnicodeTranslateError` will be passed to the handler and that the replacement from the error handler will be put into the output directly.
pl: Dekodowanie i zamiana nazw pracują podobnie z wyjątkiem :exc:`UnicodeDecodeError` lub :exc:`UnicodeTranslateError` zostaną przekazane do obsługi i że zamiennik dla obsługi błędu zostanie włożona do wyjściowego katalogu.

source: Return the error handler previously registered under the name *name*.
pl: Zwróć obsługę błędu poprzednio zarejestrowanym pod nazwą *name*.

source: Raises a :exc:`LookupError` in case the handler cannot be found.
pl: Zgłasza wyjątek :exc:`LookupError` w przypadku gdy obsługa nie może być znaleziona.

source: Implements the ``strict`` error handling: each encoding or decoding error raises a :exc:`UnicodeError`.
pl: Wypełnia ``strict`` - z ang - ścisłą obsługę błędu: każde błędy kodowania lub dekodowania zgłaszają :exc:`UnicodeError`.

source: Implements the ``replace`` error handling: malformed data is replaced with a suitable replacement character such as ``'?'`` in bytestrings and ``'\ufffd'`` in Unicode strings.
pl: Wypełnia obsługę błędu ``replace``: nieuformowane dane są zamieniane na odpowiedni znak zamienny taki jak ``'?'`` w ciągach bajtów i ``'ufffd'`` w ciągu Unicode.

source: Implements the ``ignore`` error handling: malformed data is ignored and encoding or decoding is continued without further notice.
pl: Wypełnia obsługę błędu ``ignoruj``: nieuformowane dane są ignorowane, a kodowanie lub dekodowanie jest kontynuowane bez dalszego powiadamiania.

source: Implements the ``xmlcharrefreplace`` error handling (for encoding only): the unencodable character is replaced by an appropriate XML character reference.
pl: Wypełnia ``xmlcharrefreplace`` obsługę błędu (jedynie dla kodowania): niekodowalny znak jest zamieniany przez odpowiednie odniesienie znakowe XML.

source: Implements the ``backslashreplace`` error handling (for encoding only): the unencodable character is replaced by a backslashed escape sequence.
pl: Wypełnia obsługę błędu ``backslashreplace`` (jedynie dla kodowania): niekodowalny znak jest zamieniany przez skośnikowaną sekwencję ucieczkową.

source: To simplify working with encoded files or stream, the module also defines these utility functions:
pl: Aby uprościć pracę z zakodowanymi plikami lub strumieniami, moduł także definiuje te zadania użytkowe:

source: Open an encoded file using the given *mode* and return a wrapped version providing transparent encoding/decoding. The default file mode is ``'r'`` meaning to open the file in read mode.
pl: Otwórz zakodowany plik używając danego *trybu* i zwróć zapakowaną wersję dostarczającą przezroczyste kodowanie/dekodowanie. Domyślny tryb pliku jest ``'r'`` w znaczeniu otwarcia pliku w trybie odczytu.

source: The wrapped version's methods will accept and return strings only. Bytes arguments will be rejected.
pl: Zapakowane sposoby postępowania wersji będą akceptować i zwracać tylko ciągi znaków. Parametry bajtowe zostaną odrzucone.

source: Files are always opened in binary mode, even if no binary mode was specified. This is done to avoid data loss due to encodings using 8-bit values. This means that no automatic conversion of ``b'\n'`` is done on reading and writing.
pl: Pliki są zawsze otwierane w trybie binarnym, nawet jeśli żadne tryby binarne nie były określone. To jest robione po to aby uniknąć utraty danych z powodu kodowania 8-bitowych wartości. To oznacza że żadne automatyczne konwertowanie ``b' '`` nie jest wykonywane przy wczytywaniu i zapisywaniu.

source: *encoding* specifies the encoding which is to be used for the file.
pl: *kodowanie* określa kodowanie które będzie użyte dla pliku.

source: *errors* may be given to define the error handling. It defaults to ``'strict'`` which causes a :exc:`ValueError` to be raised in case an encoding error occurs.
pl: *błędy* mogą być dane do zdefiniowania obsługi błędu. To domyślnie równe jest ``'strict'`` co powoduje że :exc:`ValueError` jest zgłaszany w przypadku błędu kodowania.

source: *buffering* has the same meaning as for the built-in :func:`open` function. It defaults to line buffered.
pl: *buforowanie* ma te same znaczenie jak dla wbudowane zadanie :func:`open`. Domyślnie równe jest buforowaniu.

source: Return a wrapped version of file which provides transparent encoding translation.
pl: Zwróć zapakowaną wersję pliku, który dostarcza przezroczystego tłumaczenia kodowania.

source: Bytes written to the wrapped file are interpreted according to the given *data_encoding* and then written to the original file as bytes using the *file_encoding*.
pl: Bajty zapisane do zapakowanego pliku są interpretowane zgodnie z danym kodowaniem *data_encoding* i wtedy zapisane do oryginalnego pliku jako bajty używając *file_encoding*.

source: If *file_encoding* is not given, it defaults to *data_encoding*.
pl: Jeśli *file_encoding* nie jest dane, domyślnie równe jest *data_encoding*.

source: *errors* may be given to define the error handling. It defaults to ``'strict'``, which causes :exc:`ValueError` to be raised in case an encoding error occurs.
pl: *errors* błędy mogą być dane do zdefiniowania obsługi błędów. Domyślnie równe jest ``'strict'``, co powoduje, że :exc:`ValueError` będzie zgłaszany w przypadku gdy błąd kodowania nastąpi.

source: Uses an incremental encoder to iteratively encode the input provided by *iterator*. This function is a :term:`generator`. *errors* (as well as any other keyword argument) is passed through to the incremental encoder.
pl: Używa zwiększającego kodera do iteracyjnego zakodowania wejścia dostarczonego przez *iterator*. To zadanie jest :term:`generatorem`. *błędy* - z ang. - *errors* (zarówno jak inne parametry słów kluczowych) jest przekazywane dalej do przyrostowego kodera.

source: Uses an incremental decoder to iteratively decode the input provided by *iterator*. This function is a :term:`generator`. *errors* (as well as any other keyword argument) is passed through to the incremental decoder.
pl: Używa przyrostowego dekodera do iteracyjnego dekodowania wejścia dostarczonego przez *iterator*. To zadanie jest :term:`generatorem`. *błędy* - z ang. - *errors* (zarówno jak inne parametry słów kluczowych) są przekazywane dalej do przyrostowego dekodera.

source: The module also provides the following constants which are useful for reading and writing to platform dependent files:
pl: Ten moduł także dostarcza następujące stałe które są użyteczne dla wczytywania i zapisywania plików zależnych od maszyny/środowiska:

source: These constants define various encodings of the Unicode byte order mark (BOM) used in UTF-16 and UTF-32 data streams to indicate the byte order used in the stream or file and in UTF-8 as a Unicode signature. :const:`BOM_UTF16` is either :const:`BOM_UTF16_BE` or :const:`BOM_UTF16_LE` depending on the platform's native byte order, :const:`BOM` is an alias for :const:`BOM_UTF16`, :const:`BOM_LE` for :const:`BOM_UTF16_LE` and :const:`BOM_BE` for :const:`BOM_UTF16_BE`. The others represent the BOM in UTF-8 and UTF-32 encodings.
pl: Te stałe określają różne kodowania Unikodowych znaków porządku bajtów (BOM - z ang. - byte order mark) używanych w ciągach danych UTF-16 i UTF-32 do wskazywania porządku bajtów używanych w strumieniu lub pliku i w UTF-8 jako sygnatury Unicode. :const:`BOM_UTF16` jest albo :const:`BOM_UTF16_BE` lub :const:`BOM_UTF16_LE` w zależności od natywnego porządku bajtów maszyny/środowiska, :const:`BOM` jest synonimem dla :const:`BOM_UTF16`, :const:`BOM_LE` dla :const:`BOM_UTF16_LE` i :const`BOM_BE` dla :const:`BOM_UTF16_BE`. Inne reprezentują BOM w kodowaniach UTF-8 i UTF-32.

source: Codec Base Classes
pl: Uogólnienia podstawowe kodeków

source: The :mod:`codecs` module defines a set of base classes which define the interface and can also be used to easily write your own codecs for use in Python.
pl: Moduł :mod:`codecs` definiuje zestaw uogólnień podstawowych które definiują sprzęg i może także być używany do łatwego pisania twoich własnych kodeków dla użycia w języku pytonowskim.

source: Each codec has to define four interfaces to make it usable as codec in Python: stateless encoder, stateless decoder, stream reader and stream writer. The stream reader and writers typically reuse the stateless encoder/decoder to implement the file protocols.
pl: Każdy kodek musi definiować cztery sprzęgi aby spowodować że będzie użyteczny jako kodek w języku pytonowskim: bezstanowy koder, bezstanowy dekoder, strumieniowy czytnik i strumieniowy zapis. Strumieniowe czytanie i pisanie typowo ponownie używają bezstanowy koder/dekoder aby wypełnić protokoły plikowe.

source: The :class:`Codec` class defines the interface for stateless encoders/decoders.
pl: Uogólnienie :class:`Codec` definiuje sprzęg dla bezstanowego kodera/dekodera.

source: To simplify and standardize error handling, the :meth:`encode` and :meth:`decode` methods may implement different error handling schemes by providing the *errors* string argument. The following string values are defined and implemented by all standard Python codecs:
pl: Aby uprościć i standaryzować obsługę błędu, sposoby postępowania :meth:`encode` i :meth:`decode` mogą wypełniać inne błędne schematy obsługi przez dostarczenie *błędów* - z ang. - *error* parametrów ciągów znaków. Następujące ciągi znaków są definiowane i wypełniane przez wszystkie standardowe kodeki języka pytonowskiego:

source: Value
pl: Wartość

source: Meaning
pl: Znaczenie

source: ``'strict'``
pl: ``'ściśle'`` - z ang. - ``'strict'``

source: Raise :exc:`UnicodeError` (or a subclass); this is the default.
pl: Zgłoś :exc:`UnicodeError` (lub podrzędne uogólnienie); to jest domyślnie.

source: ``'ignore'``
pl: ``'ignoruj'``

source: Ignore the character and continue with the next.
pl: Ignoruje znak i kontynuuj z następnym.

source: ``'replace'``
pl: ``'zamień'`` - z ang. - ``'replace'``

source: Replace with a suitable replacement character; Python will use the official U+FFFD REPLACEMENT CHARACTER for the built-in Unicode codecs on decoding and '?' on encoding.
pl: Zamień na odpowiedni znak zastępczy; Język pytonowski będzie używał oficjalnego ZNAKU ZASTĘPCZEGO U+FFFD dla wbudowanych kodeków Unicode na dekodowanie i '?' na kodowanie.

source: Replace with the appropriate XML character reference (only for encoding).
pl: Zamień na odpowiedni znak XML - znak odniesienia (tylko dla kodowania).

source: Replace with backslashed escape sequences (only for encoding).
pl: Zamień na sekwencję skośnikowaną ucieczkową (tylko dla kodowania).

source: Replace byte with surrogate U+DCxx, as defined in :pep:`383`.
pl: Zamień na surogat U+DCxx, jak opisano w :pep:`383`.

source: In addition, the following error handlers are specific to a single codec:
pl: W dodatku następujące obsługi błędów są szczególne dla pojedynczego kodeka:

source: Codec
pl: Kodek

source: Allow encoding and decoding of surrogate codes in UTF-8.
pl: Pozwala na kodowanie i dekodowanie kodów surogatów w UTF-8.

source: The set of allowed values can be extended via :meth:`register_error`.
pl: Zestaw dozwolonych wartości może być rozszerzony przez :meth:`register_error`.

source: Codec Objects
pl: Przedmioty kodeków

source: The :class:`Codec` class defines these methods which also define the function interfaces of the stateless encoder and decoder:
pl: Uogólnienie :class:`Codec` definiuje te metody które mogą także definiować sprzęgi zadań bezstanowego kodera i dekodera:

source: Encodes the object *input* and returns a tuple (output object, length consumed). Encoding converts a string object to a bytes object using a particular character set encoding (e.g., ``cp1252`` or ``iso-8859-1``).
pl: Koduje przedmiot *input* i zwraca krotkę (wyjściowy przedmiot, długość skonsumowana). Kodowanie konwertuje przedmiot ciągu do przedmiotu bajtów używając szczególnego zestawu znaków kodowania (np., ``cp1252`` lub ``iso-8859-1``).

source: *errors* defines the error handling to apply. It defaults to ``'strict'`` handling.
pl: *errors* definiuje obsługę błędów do zastosowania. Domyślnie jest to ``'ścisła'`` ( - z ang. ``'strict'`` ) obsługa.

source: The method may not store state in the :class:`Codec` instance. Use :class:`StreamCodec` for codecs which have to keep state in order to make encoding/decoding efficient.
pl: Sposób postępowania może nie zachowywać stanu w przykładzie :class:`Codec`. Użyj :class:`StreamCodec` dla kodeków które muszą utrzymywać stan w celu uczynienia kodowania/dekodowania efektywnym.

source: The encoder must be able to handle zero length input and return an empty object of the output object type in this situation.
pl: Koder musi być w stanie obsłużyć wejście o długości zerowej i zwrócić pusty przedmiot wyjściowego typu przedmiotu w tej sytuacji.

source: Decodes the object *input* and returns a tuple (output object, length consumed). Decoding converts a bytes object encoded using a particular character set encoding to a string object.
pl: Dekoduje przedmiot wejściowy *input* i zwróć krotkę (wyjściowy przedmiot, długość skonsumowana). Dekodowanie zamienia przedmiot bajtów zakodowany używając szczególnego zestawu znaków kodowania do przedmiotu ciągu znaków.

source: *input* must be a bytes object or one which provides the read-only character buffer interface -- for example, buffer objects and memory mapped files.
pl: *wejście* musi być przedmiotem bajtów lub takiego który dostarcza sprzęg przestrzeni wymiany znaków tylko do odczytu -- dla przykładu, przedmiot przestrzeni wymiany i plików mapowanych w pamięci.

source: The decoder must be able to handle zero length input and return an empty object of the output object type in this situation.
pl: Dekoder musi być zdolny aby obsłużyć zerowej długości i zwrócić pusty przedmiot wyjściowego rodzaju przedmiotu w tej sytuacji.

source: The :class:`IncrementalEncoder` and :class:`IncrementalDecoder` classes provide the basic interface for incremental encoding and decoding. Encoding/decoding the input isn't done with one call to the stateless encoder/decoder function, but with multiple calls to the :meth:`encode`/:meth:`decode` method of the incremental encoder/decoder. The incremental encoder/decoder keeps track of the encoding/decoding process during method calls.
pl: uogólnienia :class:`IncrementalEncoder` i :class:`IncrementalDecoder` dostarczają podstawowy sprzęg do zwiększającego się kodowania i dekodowania. Kodowanie/dekodowanie wejścia nie jest dokonywana za pomocą jednego wywołania zadania bezstanowego kodera/dekodera, ale za pomocą wielokrotnych odwołań do sposobu postępowania :meth:`encode`/:meth:`decode` zwiększającego się kodera/dekodera. Zwiększający koder/dekoder pilnuje procesu kodowania/dekodowania w czasie wywołania sposobów postępowania.

source: The joined output of calls to the :meth:`encode`/:meth:`decode` method is the same as if all the single inputs were joined into one, and this input was encoded/decoded with the stateless encoder/decoder.
pl: Połączone wyjście wywołania sposobów postępowania :meth:`encode`/:meth:`decode` jest to samo co jeśli wszystkie pojedyncze wejścia byłyby połączone w jedno, i to wejście było zakodowane/zdekodowane bezstanowym koderem/dekoderem.

source: IncrementalEncoder Objects
pl: Przedmioty IncrementalEncodera

source: The :class:`IncrementalEncoder` class is used for encoding an input in multiple steps. It defines the following methods which every incremental encoder must define in order to be compatible with the Python codec registry.
pl: Uogólnienie :class:`IncrementalEncoder` jest używane dla kodowania wejścia w wielu krokach. Określa ona następujące sposoby postępowania które każdy zwiększający się koder musi definiować w celu aby być kompatybilnym z rejestrem kodeków języka pytonowskiego.

source: Constructor for an :class:`IncrementalEncoder` instance.
pl: Konstruktor dla przykładu uogólnienia :class:`IncrementalEncoder`.

source: All incremental encoders must provide this constructor interface. They are free to add additional keyword arguments, but only the ones defined here are used by the Python codec registry.
pl: Wszystkie zwiększające kodery muszą dostarczać ten sprzęg konstruktora. Wolno im dodawać dodatkowe parametry słów kluczowych, ale tylko te zdefiniowane tutaj są używane przez rejestr kodeków języka pytonowskiego.

source: The :class:`IncrementalEncoder` may implement different error handling schemes by providing the *errors* keyword argument. These parameters are predefined:
pl: Uogólnienie :class:`IncrementalEncoder` może wypełniać różne schematy obsługi błędów przez dostarczanie parametru słowa kluczowego *errors*. Te parametry są zdefiniowane na stałe:

source: ``'strict'`` Raise :exc:`ValueError` (or a subclass); this is the default.
pl: ``'strict'`` - z ang. - ``'ścisłe'`` Zgłoś :exc:`ValueError` (lub podrzędne uogólnienia); to jest domyślne.

source: ``'ignore'`` Ignore the character and continue with the next.
pl: ``'ignore'`` Ignoruj znak i kontynuuj z następnym.

source: ``'replace'`` Replace with a suitable replacement character
pl: ``'zamień'`` Zamień na odpowiedni znak zamiany

source: ``'xmlcharrefreplace'`` Replace with the appropriate XML character reference
pl: ``'xmlcharrefreplace'`` Zamień na odpowiedni XML znak odniesienia

source: ``'backslashreplace'`` Replace with backslashed escape sequences.
pl: ``'backslashreplace'`` Zamień na sekwencję ucieczkową skośnikowaną.

source: The *errors* argument will be assigned to an attribute of the same name. Assigning to this attribute makes it possible to switch between different error handling strategies during the lifetime of the :class:`IncrementalEncoder` object.
pl: Parametr *errors* zostanie przypisany do właściwości o tej samej nazwie. Przypisywanie do tej właściwości umożliwia zamianę pomiędzy różnymi strategiami obsługi w czasie życia przedmiotu :class:`IncrementalEncoder`.

source: The set of allowed values for the *errors* argument can be extended with :func:`register_error`.
pl: Zbiór dozwolonych wartości parametru *errors* może być rozszerzany za pomocą zadania :func:`register_error`.

source: Encodes *object* (taking the current state of the encoder into account) and returns the resulting encoded object. If this is the last call to :meth:`encode` *final* must be true (the default is false).
pl: *Przedmiot* Koderów (wliczający obecny stan kodera) i zwraca wynikający przedmiot kodowania. Jeśli to jest ostatnie wywołanie sposobu postępowania :meth:`encode` *final* musi być prawdziwe (domyślnie jest fałsz).

source: Reset the encoder to the initial state.
pl: Resetuj koder do stanu początkowego.

source: Return the current state of the encoder which must be an integer. The implementation should make sure that ``0`` is the most common state. (States that are more complicated than integers can be converted into an integer by marshaling/pickling the state and encoding the bytes of the resulting string into an integer).
pl: Zwróć obecny stan kodera który musi być liczbą całkowitą. Wypełnienie powinno upewnić się że ``0`` jest najczęstszym stanem. (Stany, które są bardziej skomplikowane niż liczby całkowite mogą być zamienione na liczbę całkowitą, przez maszerowanie/peklowanie stanu i kodowanie bajtów wynikłych ciągów znaków do liczby całkowitej).

source: Set the state of the encoder to *state*. *state* must be an encoder state returned by :meth:`getstate`.
pl: Ustaw stan kodera na *stan*. *stan* musi być stanem kodera zwracanym przez :meth:`getstate`.

source: IncrementalDecoder Objects
pl: Przedmioty IncrementalDecoder

source: The :class:`IncrementalDecoder` class is used for decoding an input in multiple steps. It defines the following methods which every incremental decoder must define in order to be compatible with the Python codec registry.
pl: Uogólnienie :class:`IncrementalDecoder` jest używany dla dekodowania wejścia w kilku krokach. Określa on następujące sposoby postępowania, które każdy przyrostowy dekoder musi określać w celu pozostania kompatybilnym z rejestrem kodeków języka pytonowskiego.

source: Constructor for an :class:`IncrementalDecoder` instance.
pl: Konstruktor dla przykładu uogólnienia przyrostowego dekodera :class:`IncrementalDecoder`.

source: All incremental decoders must provide this constructor interface. They are free to add additional keyword arguments, but only the ones defined here are used by the Python codec registry.
pl: Wszystkie przyrostowe dekodery muszą dostarczać ten sprzęg konstruktora. Wolno im dodawać dodatkowe parametry kluczowe, ale tylko te zdefiniowane tutaj są używane przez rejestr kodeków języka pytonowskiego.

source: The :class:`IncrementalDecoder` may implement different error handling schemes by providing the *errors* keyword argument. These parameters are predefined:
pl: Uogólnienie :class:`IncrementalDecoder` może wypełniać różne schematy obsługi błędów przez dostarczenie parametru słowa kluczowego *errors*. Te parametry są uprzednio zdefiniowane:

source: ``'replace'`` Replace with a suitable replacement character.
pl: ``'replace'`` Zamień na odpowiedni znak zastępczy.

source: The *errors* argument will be assigned to an attribute of the same name. Assigning to this attribute makes it possible to switch between different error handling strategies during the lifetime of the :class:`IncrementalDecoder` object.
pl: Parametr *errors* zostanie przypisany do właściwości o tej samej nazwie. Przypisanie do tej właściwości umożliwia zamianę pomiędzy różnymi strategiami obsługi błędów w czasie bytności przedmiotu :class:`IncrementalDecoder`.
